using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using JericoDataBase.Models;
using Microsoft.EntityFrameworkCore;
using System.Drawing;
using System.IO;

namespace JericoDataBase
{



    public class JericoDbContext : DbContext
    {
public DbSet<Basket> Baskets { get; set; }
        public DbSet<Catalog> Catalogs { get; set; }
        public DbSet<Category> Categories { get; set; }
        public DbSet<Model> Models { get; set; }
        public DbSet<Product> Products { get; set; }
        public DbSet<User> Users { get; set; }
        public DbSet<Status> Statuse { get; set; }
        public DbSet<TypeUser> TypeUsers { get; set; }
        public DbSet<Order> Orders { get; set; }
        public DbSet<PersonalArea> PersonalAreas { get; set; }
        public DbSet<Feedback> Feedbacks { get; set; }
        public DbSet<Storage> Storages { get; set; }
        


        public JericoDbContext(DbContextOptions<JericoDbContext> options) : base(options)
        {
            Database.EnsureCreated();
        }



        protected override void OnModelCreating(ModelBuilder modelBuilder)
        {
           

            modelBuilder.Entity<Status>().HasData(
                new Status
                {
                    ID = 1,
                    NameStatus = "Начальный"
                },
                new Status
                {
                    ID = 2,
                    NameStatus ="Новый"
                },
                new Status
                {
                    ID = 3,
                    NameStatus = "Принятый"
                },
                new Status
                {
                    ID = 4,
                    NameStatus = "Оконченный"
                }
                );




            modelBuilder.Entity<TypeUser>().HasData(
                new TypeUser
                {
                    ID = 1,
                    TypeUsers = "Админ"
                },
                new TypeUser
                {
                    ID = 2,
                    TypeUsers = "Бухгалтер"
                },
                    new TypeUser
                {
                    ID = 3,
                    TypeUsers = "Пользователь"
                }
                );

            
            modelBuilder.Entity<Model>().HasData(
            new Model
            {
                ID = 1,
                NameModel = "Черновая отделка",
                Description = "Отделка гипсокартоном." +
                "Это черновой вид отделки, подразумевающий впоследствии чистовую отделку. Используется для лёгкого и быстрого выравнивания стены." +
                " Работа не сопровождается большими мусорными отходами и грязью. Подходит для любой комнаты в жилом доме."

            }
            );
            modelBuilder.Entity<PersonalArea>().HasData(
                new PersonalArea
                {
                    ID = 1,
                    Addres = "Заполните данные",
                    FIO = "Заполните данные",
                    Postcode = "Заполните данные",
                    Telefon = "Заполните данные",
                    DateBirth = "Заполните данные"
                }



                );
            DirectoryInfo directorys = new DirectoryInfo(@"Image");
            string image = directorys.FullName + "\\" + "Avatar.jpg";
            MemoryStream memoryStream = new MemoryStream();

            FileStream fs = new FileStream(image, FileMode.Open, FileAccess.Read);
            // Create a byte array of file stream length
            byte[] ImageData = new byte[fs.Length];
            //Read block of bytes from stream into the byte array
            fs.Read(ImageData, 0, System.Convert.ToInt32(fs.Length));
            //Close the File Stream
            fs.Close();

            modelBuilder.Entity<User>().HasData(
                new User
                {
                    ID=1,
                    Login="Recrut",
                    Email="Bogamesalex@mail.ru",
                    Password="#123#123#",
                    TypeUserID=2,
                    PersonalAreaID = 1,
                    Image = ImageData
                });

            modelBuilder.Entity<Product>().HasData(
                new Product()
                {
                    ID = 1,
                    CategoryID = 1,
                    ModelID = 1
                },
                new Product()
                {
                    ID = 2,
                    CategoryID = 1,
                    ModelID = 2
                },
                new Product()
                {
                    ID = 3,
                    CategoryID = 1,
                    ModelID = 3
                },
                new Product()
                {
                    ID = 4,
                    CategoryID = 1,
                    ModelID = 4
                },
                new Product()
                {
                    ID = 5,
                    CategoryID = 1,
                    ModelID = 5
                },
                new Product()
                {
                    ID = 6,
                    CategoryID = 1,
                    ModelID = 6
                },
                new Product()
                {
                    ID = 7,
                    CategoryID = 1,
                    ModelID = 7
                }
                );

            modelBuilder.Entity<Model>().HasData(
            new Model
            {
                ID = 1,
                NameModel = "Снятие и сохранение плодородного слоя земли на месте построек.",
                Description = "снятие плодородного слоя почвы, хранение его во временном отвале, " +
                "расположенном вдоль строительной полосы в пределах, предусмотренных нормами отвода, " +
                "и использование для рекультивации или землевания после окончания строительных и планировочных работ."
            },
            new Model
            {
                ID = 2,
                NameModel = "Рытье котлована или траншей под фундамент.",
                Description = "Фундамент – основа любого здания. Его надежность и долговечность зависят от того, насколько грамотно подошли строители к земляным работам. " +
                "Чтобы правильно вырыть траншею или котлован под фундамент, нужны специальные знания и умения. " +
                "Только в этом случае будут учтены факторы, влияющие на ровность котлована и будущих стен."
            },
            new Model
            {
                ID = 3,
                NameModel = "Закладка необходимых коммуникаций под фундаментом.",
                Description = "Закладка необходимых коммуникаций под фундаментом (канализация, водопровод и т.п.). " +
                "Желательно устроить под общей плитой фундамента дренаж и дополнительную сливную трубу для канализации, " +
                "которую затем подключить к общей трубе слива посредством специального насоса."
            },
            new Model
            {
                ID = 4,
                NameModel = "Строительство и гидроизоляция фундамента, дренаж.",
                Description = "Для фундаментов, цоколей, тоннелей и прочих сооружений, находящихся ниже уровня грунтовых вод, " +
                "гидроизоляция имеет огромное значение и ее минимальное повреждение может привести к крупным течам. Исходя из этих рисков, " +
                "единственно надежные гидроизоляционные решения, которые должны применяться против гидростатического давления воды - это применение полимерных мембран и дренажных мембран."
            },
            new Model
            {
                ID = 5,
                NameModel = "Установка общей заземляющей шины.",
                Description = "ГЗШ предназначена для организации системы уравнивания потенциалов в системах заземления TN-C-S и TN-S. " +
                "Главная заземляющая шина (ГЗШ), или ее еще называют шина PE, устанавливается в вводном распределительном устройстве (ВРУ) или за его пределами в отдельном шкафу."
            },
            new Model
            {
                ID = 6,
                NameModel = "Засыпка остаточных пустот вокруг фундамента, перекрытие подвала(при его наличии).",
                Description = ""
            },
            new Model
            {
                ID = 7,
                NameModel = "Возведение стен и перекрытие этажей.",
                Description = "Стена́ — структурный элемент в архитектуре и строительстве, создающий внешний периметр здания или помещения в виде вертикальной ограждающей конструкции, " +
                "отделяющей помещение от окружающего пространства или соседних комнат. Перекрытие - это горизонтальная несущая конструкция отделяющая один этаж о другого. Перекрытие служит несущей основой для пола этажа. " +
                "Оно воспринимает все нагрузки от людей, мебели, оборудования всего остального к чему мы привыкли в нашей повседневной жизни и передает эти нагрузки на несущие стены или через ригели на колонны. "
            }

            );

            modelBuilder.Entity<Feedback>().HasData
                (
                new Feedback()
                {
                    ID = 1,
                    DateTime = "",
                    ProductFeedback = "Компания хорошая, всё сделали быстро и качественно",
                    UserID = 1
                },
                new Feedback()
                {
                    ID = 2,
                    DateTime = "",
                    ProductFeedback = "Компания хорошая, построила высокий дом",
                    UserID = 1
                },
                new Feedback()
                {
                    ID = 3,
                    DateTime = "",
                    ProductFeedback = "Компания хорошая, дружелюбные, любят общаться и делают всё быстро",
                    UserID = 1
                }
                );

            modelBuilder.Entity<Category>().HasData
                (
                new Category()
                {
                    ID = 1,
                    NameCategory = "Нулевой цикл",
                    Description = "На этом этапе производится возведение фундамента дома и «нулевого» этажа, то есть подвала (если он есть в проекте). Выполняются следующие работы: "
                    + "1. Снятие и сохранение плодородного слоя земли на месте построек "
                    + "2. Рытьё котлована или траншей под фундамент (в зависимости от наличия подвала и типа фундамента). В случае ленточного фундамента и при отсутствии подвала выемку грунта под фундамент можно провести вручную, "
                    + "иначе лучше доверить это дело технике. После автоматизированной выемки грунта дно котлована зачищают вручную и желательно сразу после этого приступить к устройству фундамента, "
                    + "чтобы избежать замусоривания котлована в результате плохой погоды, "
                    + "обсыпания стен котлована и т.п. "
                    + "3. Закладка необходимых коммуникаций под фундаментом (канализация, водопровод и т.п.). Желательно устроить под общей плитой фундамента дренаж и дополнительную сливную трубу для канализации, "
                    + "которую затем подключить к общей трубе слива посредством специального насоса. "
                    + "4. Строительство и гидроизоляция фундамента, дренаж;"
                    + "5. Установка общей заземляющей шины (в зависимости от проекта), к которой затем будет подключено заземление электросети дома;"
                    + "6. Засыпка остаточных пустот вокруг фундамента, перекрытие подвала(при его наличии)."
                },
                new Category()
                {
                    ID = 2,
                    NameCategory = "Основные строительные работы",
                    Description = "Это этап выполнения основных строительных работ: "
                    + "1. Возведение стен и перекрытие этажей; "
                    + "2. Монтаж внутренних перегородок, лестниц; "
                    + "3. Строительство крыши и навесов; "
                    + "4. Установка наружных дверей, ворот (для гаража), окон; "
                    + "5. Внешняя отделка стен дома (сайдинг, штукатурка, фасадный кирпич, декоративный камень и т. п.)."
                },
                new Category()
                {
                    ID = 3,
                    NameCategory = "Проведение коммуникаций",
                    Description = "На этом этапе проводятся все основные коммуникации в доме и устанавливается часть инженерного оборудования: "
                    + "1. Электрическая сеть (монтируется главный щит, прячется в стены основная проводка, делаются подрозетники и ставятся временные розетки); "
                    + "2. Водопровод (прокладываются трубы, ставятся временные краны и заглушки); "
                    + "3. Канализация; "
                    + "4. Система отопления (трубы, нагревательный котёл); "
                    + "5. Газ (при наличии). "
                    + "6. Вентиляция и кондиционирование(вентиляционные короба и инженерное оборудование кроме внутренних блоков, которые монтируются на этапе внутренней отделки); "
                    + "7. Охранно - пожарная сигнализация, видеонаблюдение, интернет и телевидение (закладка кабельных линий)."
                },
                new Category()
                {
                    ID = 4,
                    NameCategory = "Внутренняя отделка",
                    Description =
                      "1. Оформление потолков (покраска, подвесные или натяжные потолки); "
                    + "2. Обработка стен(выравнивание, шпаклевка, поклейка обоев и т.п.); "
                    + "3. Стяжка пола(для бетонных полов), укладка напольных покрытий; "
                    + "4. Установка межкомнатных дверей; "
                    + "5. Окончательный монтаж инженерного оборудования (осветительные приборы и розетки, датчики и управляющие блоки охранно-пожарной сигнализации, компьютерная сеть, телевизионное оборудование, радиаторы отопления, и т.п.); "
                },
                new Category()
                {
                    ID = 5,
                    NameCategory = "Оформление интерьера и ландшафтный дизайн",
                    Description = "Это последний этап, на котором интерьер дома и внешний вид участка окончательно приводят к желаемому виду. "
                    + "1. Установка забора,ворот и калитки; "
                    + "2. Устройство дорожек и подъездного пути к гаражу; "
                    + "3. Разбивка цветников, живых изгородей, навесов из вьющихся растений (декоративный плющ, дикий виноград); "
                    + "4. Обустройство бассейна и т.д."
                }
                );

        }
    }
}
